/* Common: dialog buttons */
"CLOSE" = "Close";
"OK" = "OK";
"CANCEL" = "Cancel";
"YES" = "Yes";
"NO" = "No";
"REPLACE" = "Replace";

/* Common: values & status */
"AUTO" = "Auto";
"MANUAL" = "Manual";
"DEFAULT" = "Default";
"DEFAULT VALUE" = "Default";
"NONE" = "None";
"NO ITEM" = "No Item";
"1 ITEM" = "1 item";
"%ld ITEMS" = "%ld items";
"NEVER" = "Never";
"ON" = "On";
"OFF" = "Off";
"ALL" = "All";
"ETC." = "Etc.";
"UNKNOWN" = "Unknown";
"NO NAME" = "No Name";
"EMPTY" = "Empty";
"HIDDEN" = "Hidden";
"SEC." = "sec.";
"%+.1f SEC" = "%+.1f sec.";
"%g SEC PULL" = "%g sec. Pull";
"%g SEC PUSH" = "%g sec. Push";
"OR" = "or";

/* Common: actions */
"ROTATION" = "Rotation";
"REVERSE ROTATION" = "Reverse Rotation";
"RESET" = "Reset";

/* Common: file open error messages */
"FILE NOT FOUND" = "File Not Found";
"FILE NOT READABLE" = "File Not Readable";
"FILE NOT READABLE MESSAGE" = "Check the read privileges if exist.";
"FILE OPEN ERROR" = "File Open Error";

/* Common: file save error messages */
"FILE SAVE ERROR" = "File Save Error";
"EMPTY NAME" = "Empty Name";
"EMPTY NAME WARNING" = "No name is entered.\nEnter valid name.";
"SAME NAME EXIST" = "Same Name Exists.";
"\"%@\" ALREADY EXIST" = "\"%@\" already exists.";

/* Common: sand-box messages */
"FOLDER ACCESS DENIED BY APP SANDBOX" = "Folder Access Denied by App Sandbox";
"SHOW ACCESSIBLE FOLDERS…" = "Show Accessible Folders…";
"SANDBOX FILE MESSAGE" = "Access may be denied by App Sandbox. Playlist that is made by previous version should be remade for security processing.\nAdd container folder to Preferences > Advanced > Security > Accessible Folders.";
"APP SANDBOX OPEN PANEL VIEW MESSAGE" = "Press [Open] button\nto find subtitle and movie series files.";
"APP SANDBOX OPEN PANEL VIEW INFO" = "This is for temporary access to this folder and all of its subfolders.\nFor permanent access, add to \"Accessible Folders\" in Preferences.";

/* Common: etc. */
"OS X %@ NEEDED" = "This feature is supported in OS X %@ or later";

////////////////////////////////////////////////////////////////////////////////

/* Main Menu */
"FILE" = "File";
"EDIT" = "Edit";
"PLAYBACK" = "Playback";
"VIDEO" = "Video";
"AUDIO" = "Audio";
"SUBTITLE" = "Subtitle";
"WINDOW" = "Window";
"HELP" = "Help";

/* Main Menu > Movist */
"ABOUT MOVIST" = "About Movist";
//--
"VISIT WEBSITE" = "Visit Website";
"SEND BUG REPORT…" = "Send Bug Report…";
//--
"PREFERENCES…" = "Preferences…";
//--
"SERVICES" = "Services";
//--
"HIDE MOVIST" = "Hide Movist";
"HIDE OTHERS" = "Hide Others";
"SHOW ALL" = "Show All";
//--
"QUIT MOVIST" = "Quit Movist";

/* Main Menu > File */
"NEW WINDOW" = "New Window";
//--
"OPEN FILES…" = "Open Files…";
"REOPEN WITH %@" = "Reopen with %@";
"OPEN RECENT" = "Open Recent";
//--
"CLOSE MOVIE" = "Close Movie";
"CLOSE WINDOW" = "Close Window";
//--
"SAVE PLAYLIST…" = "Save Playlist…";
"SAVE PLAYLIST AS…" = "Save Playlist As…";
//--
"ADD FILES TO PLAYLIST…" = "Add Files to Playlist…";
"NEXT" = "Next";
"PREVIOUS" = "Previous";
//--
"SHUFFLE" = "Shuffle";
"REPEAT" = "Repeat";
    /* Main Menu > File > Repeat */
    //"OFF"
    //"ALL"
    "ONE" = "One";
    //"ROTATION"
//--
"ENTER NAVIGATION" = "Enter Navigation";
"EXIT NAVIGATION" = "Exit Navigation";

/* Main Menu > Edit */
"UNDO" = "Undo";
"REDO" = "Redo";
//--
"CUT" = "Cut";
"COPY" = "Copy";
"PASTE" = "Paste";
"DELETE" = "Delete";
"SELECT ALL" = "Select All";

/* Main Menu > Playback */
"PLAY" = "Play";
"PAUSE" = "Pause";
//--
"BEGINNING" = "Beginning";
"BACKWARD %g SEC" = "Backward %g sec.";
"FORWARD %g SEC" = "Forward %g sec.";
"BACKWARD SUBTITLE" = "Backward Subtitle";
"FORWARD SUBTITLE" = "Forward Subtitle";
"BACKWARD CHAPTER" = "Backward Chapter";
"FORWARD CHAPTER" = "Forward Chapter";
"BACKWARD BOOKMARK" = "Backward Bookmark";
"FORWARD BOOKMARK" = "Forward Bookmark";
"STEP BACKWARD" = "Step Backward";
"STEP FORWARD" = "Step Forward";
//--
"CHAPTERS" = "Chapters";
"BOOKMARKS" = "Bookmarks";
    /* Main Menu > Playback > Bookmark */
    "ADD BOOKMARK…" = "Add Bookmark…";
    "EDIT BOOKMARKS…" = "Edit Bookmarks…";
//--
"RANGE REPEAT CLEAR" = "Range Repeat Clear";
"RANGE REPEAT BEGIN" = "Range Repeat Begin";
"RANGE REPEAT END" = "Range Repeat End";
//--
"DEFAULT SPEED" = "Default Speed";
"SPEED SLOWER" = "Speed Slower";
"SPEED FASTER" = "Speed Faster";

/* Main Menu > Video */
"ENTER FULL SCREEN" = "Enter Full Screen";
"EXIT FULL SCREEN" = "Exit Full Screen";
"DESKTOP BACKGROUND" = "Desktop Background";
//--
"HALF SIZE" = "Half Size";
"NORMAL SIZE" = "Normal Size";
"DOUBLE SIZE" = "Double Size";
"FIT TO SCREEN" = "Fit to Screen";
"USER SIZE" = "User Size";
"USER WIDTH" = "User Width";
//--
"INCREASE SIZE" = "Increase Size";
"DECREASE SIZE" = "Decrease Size";
//--
"ASPECT RATIO" = "Aspect Ratio";
    /* Main Menu > Video > Aspect Ratio */
    "DEFAULT (DAR)" = "Default (DAR)";
    "SOURCE (SAR)" = "Source (SAR)";
    "4 : 3 (TV)" = "4 : 3 (TV)";
    "16 : 9 (HDTV)" = "16 : 9 (HDTV)";
    "1.85 : 1 (SCREEN)" = "1.85 : 1 (Screen)";
    "2.35 : 1 (SCREEN)" = "2.35 : 1 (Screen)";
"SCREEN FILLING" = "Screen Filling";
    /* Main Menu > Video > Screen Filling */
    //"DEFAULT"
    "STRETCH" = "Stretch";
    "CROP" = "Crop";
    //"ROTATION"
    //--
    "UNDER SCAN" = "Under Scan";
"ZOOM" = "Zoom";
    /* Main Menu > Video > Zoom */
    "ZOOM OFF" = "Zoom Off";
    "ZOOM IN" = "Zoom In";
    "ZOOM OUT" = "Zoom Out";
    //--
    "ZOOM SCROLL WITH ARROW KEYS" = "Scroll with Arrow Keys";
        "ZOOM SCROLL INFO" = "Scroll\nturn off \"Screen with Arrow Keys\" to stop scroll";
        "USE ARROW KEYS TO SCROLL" = "use arrow keys to scroll";
        "TURN ON ARROW KEYS TO SCROLL" = "turn on \"Screen with Arrow Keys\" to scroll";
"TRANSFORM" = "Transform";
    /* Main Menu > Video > Transform */
    "ROTATE TO LEFT" = "Rotate to Left";
    "ROTATE TO RIGHT" = "Rotate to Right";
    //--
    "FLIP HORIZONTAL" = "Flip Horizontal";
    "FLIP VERTICAL" = "Flip Vertical";
    //--
    //"RESET"
"DEINTERLACE" = "Deinterlace";
"FILTERS" = "Filters";
    /* Main Menu > Video > Filters */
    "ADD PRESET…" = "Add Preset…";
    "EDIT PRESETS…" = "Edit Presets…";
    //--
    "PRESETS" = "Presets";
    //--
    "COLOR ADJUSTMENT" = "Color Adjustment";
    "CIColorControls" = "Color Controls";
        "inputBrightness" = "Brightness";
        "inputContrast" = "Contrast";
        "inputSaturation" = "Saturation";
    "CIHueAdjust" = "Hue Adjust";
    "CIGammaAdjust" = "Gamma Adjust";
    "CIExposureAdjust" = "Exposure Adjust";
    //--
    "SHARPEN" = "Sharpen";
    "CISharpenLuminance" = "Sharpen Luminance";
    "CIUnsharpMask" = "Unsharp Mask";
        "inputRadius" = "Radius";
        "inputIntensity" = "Intensity";
    //--
    "BLUR EFFECT" = "Blur";
    "CIMedianFilter" = "Median Filter";
    "CINoiseReduction" = "Noise Reduction";
        "inputNoiseLevel" = "Noise Level";
        "inputSharpness" = "Sharpness";
    "CIGaussianBlur" = "Gaussian Blur";
    "CIDiscBlur" = "Disc Blur";
    "CIBoxBlur" = "Box Blur";
    "CIMotionBlur" = "Motion Blur";
        "inputAngle" = "Angle";
    //--
    "COLOR EFFECT" = "Color Effect";
    "CIMaskToAlpha" = "Mask to Alpha";
    "CIColorInvert" = "Color Invert";
    "CIColorPosterize" = "Color Posterize";
    "CISepiaTone" = "Sepia Tone";
    //--
    "STYLIZE" = "Stylize";
    "CIBloom" = "Bloom";
    "CIGloom" = "Gloom";
    "CIEdges" = "Edges";
    "CIEdgeWork" = "Edge Work";
    //"CILineOverlay" = "LineOverlay";
        //"inputNRNoiseLevel" = "NR Noise Level";
        //"inputNRSharpness" = "NR Sharpness";
        //"inputEdgeIntensity" = "Edge Intensity";
        //"inputThreshold" = "Threshold";
    "CIPixellate" = "Pixelate";
    "CICrystallize" = "Crystallize";
    "CIPointillize" = "Pointillize";
    "CIComicEffect" = "Comic Effect";
    //--
    "REMOVE ALL FILTERS" = "Remove All Filters";
//--
"SAVE SCREENSHOT" = "Save Screenshot";

/* Main Menu > Audio */
"SELECT AUDIO" = "Select Audio";
"SOUND TRACK" = "Sound Track";
//"ROTATION"
//--
"DEFAULT SYNC." = "Default Sync.";
//"%g SEC PULL"
//"%g SEC PUSH"
//--
"EQUALIZER" = "Equalizer";
    /* Main Menu > Audio > Equalizer */
    //"ADD PRESET…"
    //"EDIT PRESETS…"
    //--
    //"OFF"
    //--
    //"MANUAL"
    //--
//--
"VOLUME UP" = "Volume Up";
"VOLUME UP (DETAILED)" = "Volume Up (Detailed)";
"SYSTEM VOLUME UP" = "System Volume Up";
"VOLUME DOWN" = "Volume Down";
"VOLUME DOWN (DETAILED)" = "Volume Down (Detailed)";
"SYSTEM VOLUME DOWN" = "System Volume Down";
"MUTE" = "Mute";
"UNMUTE" = "Unmute";
"SYSTEM MUTE" = "System Mute";
"SYSTEM UNMUTE" = "System Unmute";

/* Main Menu > Subtitle */
"SHOW SUBTITLES" = "Show Subtitles";
"HIDE SUBTITLES" = "Hide Subtitles";
//--
"SELECT SUBTITLE" = "Select Subtitle";
//--
"DEFAULT SIZE" = "Default Size";
"SIZE LARGER" = "Size Larger";
"SIZE SMALLER" = "Size Smaller";
//--
//"DEFAULT SYNC."
//"%g SEC PULL"
//"%g SEC PUSH"
//--
//"DEFAULT SPEED"
//"SPEED SLOWER"
//"SPEED FASTER"
//--
"LETTER BOX HEIGHT" = "Letter Box Height";
    /* Main Menu > Subtitle > Letter Box Height */
    // (...)
    //"DEFAULT"
    "SAME" = "Same";
    "1 LINE" = "1 Line";
    "2 LINES" = "2 Lines";
    "3 LINES" = "3 Lines";
    //"ROTATION"
"DISPLAY TYPE" = "Display Type";
    /* Main Menu > Subtitle > Display Type */
    "2D" = "2D";
    "3D - SIDE BY SIDE" = "3D - Side by Side";
    "3D - TOP AND BOTTOM" = "3D - Top and Bottom";
    //"ROTATION"
    //--
    "3D EFFECT MORE" = "3D Effect More";
    "3D EFFECT LESS" = "3D Effect Less";

/* Main Menu > Window */
"TOPMOST" = "Topmost";
"TOPMOST (ON PLAYING)" = "Topmost (On Playing)";
"MINIMIZE" = "Minimize";
"ZOOM @WINDOW" = "Zoom";
"CONTROL PANEL" = "Control Panel";
"PLAYLIST" = "Playlist";
"PROPERTIES" = "Properties";
//"PLAYBACK"
//"VIDEO"
//"AUDIO"
//"SUBTITLE"
"ROTATE ADJUSTMENTS" = "Rotate Adjustments";
//--
"BRING ALL TO FRONT" = "Bring All to Front";

/* Main Menu > Help */
"MOVIST HELP" = "Movist Help";

////////////////////////////////////////////////////////////////////////////////

/* Control Panel > Playlist */
"UNTITLED" = "Untitled";
    /* Control Panel > Playlist > settings */
    "KEEP CURRENT MOVIE SETTINGS" = "Keep Current Movie Settings";
    "SKIP" = "Skip";
    //"NEVER"
    "ENDED" = "Ended";
        /* Control Panel > Playlist > settings > Ended: */
        "DO NOTHING" = "Do Nothing";
        //--
        "CLOSE WINDOW" = "Close Window";
        "QUIT MOVIST" = "Quit Movist";
        //--
        "SLEEP" = "Sleep";
        "LOG OUT" = "Log Out";
        "SHUT DOWN" = "Shut Down";
//"1 ITEM"
//"%ld ITEMS"
    /* Control Panel > Playlist > context menu */
    "REMOVE SELECTED ITEMS" = "Remove Selected Items";
    "MOVE SELECTED ITEMS TO TRASH" = "Move Selected Items to Trash";
    //--
    "ADD FILES…" = "Add Files…";
    "ADD SUBTITLE FILES…" = "Add Subtitle Files…";
    "REMOVE %@" = "Remove %@";
    "REMOVE ALL SUBTITLE FILES" = "Remove All Subtitle Files";

/* Control Panel > Properties */
"VIDEO TRACK" = "Video Track";
//"SOUND TRACK"
    /* Control Panel > Properties > Sound Track */
    "MONO" = "Mono";
    "STEREO" = "Stereo";
    "%g CH." = "%g ch.";
"SUBTITLE TRACK" = "Subtitle Track";
"EXTERNAL SUBTITLE" = "Ext. Subtitle";
    /* Control Panel > Properties > subtitle menu */
    "DON'T USE" = "Don't Use";
    //--
    "UPPER" = "Upper";
    "CENTER" = "Center";
    "LOWER" = "Lower";

/* Control Panel > Playback */
"GO TO" = "Go to";
//"CHAPTERS"
//"BOOKMARKS"
//"ADD BOOKMARK…"
//"EDIT BOOKMARKS…"
"RANGE BEGIN" = "Begin";
"RANGE END" = "End";

/* Control Panel > Video */
"ASPECT" = "Aspect";
"FILLING" = "Filling";
"ZOOM IN @CP" = "Zoom In";
"ZOOM OUT @CP" = "Zoom Out";

/* Control Panel > Audio */
"PULL" = "Pull";
"PUSH" = "Push";

/* Control Panel > Subtitle */
"ALL SUBTITLES" = "All Subtitles";
"NO SUBTITLE" = "No Subtitle";
//--
"SMALLER" = "Smaller";
"LARGER" = "Larger";
"SLOWER" = "Slower";
"FASTER" = "Faster";
//--
//"PULL"
//"PUSH"
    /* Control Panel > Subtitle > Letter Box Height */
    //"SAME"
    //"1 LINE"
    //"2 LINES"
    //"3 LINES"
"GO TO SELECTED SUBTITLE TIME" = "Go to Selected Subtitle Time";
"SYNC. SELECTED SUBTITLE TO CURRENT TIME" = "Sync. Selected Subtitle to Current Time";
"SHOWS SUBTITLE LIST" = "Shows Subtitle List";
"AUTO SCROLL SUBTITLE LIST" = "Auto Scroll Subtitle List";
"SCROLL TO CURRENT TIME" = "Scroll to Current Time";

////////////////////////////////////////////////////////////////////////////////

/* Preferences */
"GENERAL" = "General";
//"PLAYLIST"
//"PLAYBACK"
//"VIDEO"
//"AUDIO"
//"SUBTITLE"
"NAVIGATION" = "Navigation";
"SHORTCUTS" = "Shortcuts";
"ADVANCED" = "Advanced";

/* Preferences > General */
//"GENERAL"
//"WINDOW"
"FULL SCREEN" = "Full Screen";
//"UI/UX"

/* Preferences > General > General */
"SINGLE WINDOW MODE" = "Single window mode";
"QUIT WHEN LAST WINDOW CLOSED" = "Quit when last window closed";
"RESTORE WINDOWS (RELAUNCH NEEDED)" = "Restore windows (relaunch needed)";
"RESTORE PLAY POSITION" = "Restore play position";
//--
"PREVENT SLEEP IN WINDOWED MODE" = "Prevent sleep & screen saver in windowed mode";
"USE 1:1 PIXEL MATCHING IN RETINA DISPLAY" = "Use 1:1 pixel matching in Retina Display";
"SUPPORT APPLE REMOTE" = "Support Apple Remote";
"SUPPORT MEDIA KEYS (OS X 10.6 ONLY)" = "Support media keys (OS X 10.6 only)";
//--
"STATUS MESSAGES" = "Status Messages";
"OPEN" = "Open";
//"PLAYBACK"
//"VIDEO"
//"AUDIO"
//"SUBTITLE"
//"ETC."
//--
"FILENAME TRUNCATING" = "Filename Truncating";
    /* Preferences > General > General > Filename Truncating: */
    "HEAD" = "Head";
    "MIDDLE" = "Middle";
    "TAIL" = "Tail";
"THEME" = "Theme";
"USER THEMES…" = "User Themes…";
//--
//"CONTROL PANEL"
    /* Preferences > General > General > Control Panel: */
    "LEFT SIDE" = "Left Side";
    "RIGHT SIDE" = "Right Side";
    "INSPECTOR" = "Inspector";
"SHOW ON MOUSE OVER" = "Show on mouse over";
"OPACITY" = "Opacity";
"USE SMALL SCROLLER" = "Use small scroller";

/* Preferences > General > Window */
"OPENING VIEW" = "Opening View";
    /* Preferences > General > Window > Opening View: */
    "CURRENT SIZE" = "Current Size";
    //"USER SIZE"
    //"USER WIDTH"
    //--
    //"HALF SIZE"
    //"NORMAL SIZE"
    //"DOUBLE SIZE"
    //"FIT TO SCREEN"
    //--
    //"FULL SCREEN"
    //"DESKTOP BACKGROUND"
//--
"TOPMOST MODE" = "Topmost Mode";
    /* Preferences > General > Window > Topmost Mode: */
    //"NEVER"
    "ALWAYS" = "Always";
    "ON PLAYING" = "On Playing";
//--
//"USER SIZE"
"WIDTH ONLY" = "Width Only";
//--
"RESIZE CENTER" = "Resize Center";
    /* Preferences > General > Window > Resize Center: */
    "TOP LEFT" = "Top Left";
    "TOP CENTER" = "Top Center";
    "TOP RIGHT" = "Top Right";
    //--
    "BOTTOM LEFT" = "Bottom Left";
    "BOTTOM CENTER" = "Bottom Center";
    "BOTTOM RIGHT" = "Bottom Right";
    //--
    "WINDOW CENTER" = "Window Center";
    "SCREEN CENTER" = "Screen Center";
"RESIZE STYLE" = "Resize Style";
    /* Preferences > General > Window > Resize Style: */
    "FREE STYLE" = "Free Style";
    "ADJUST TO MOVIE SIZE" = "Adjust to Movie Size";
"USE RESIZE ANIMATION" = "Use resize animation";
"RESIZE BY PINCH GESTURE" = "Resize by pinch open/close gesture";
"ROUNDED CORNER" = "Rounded corner";

/* Preferences > General > Full Screen */
"USE LION FULL SCREEN (OS X 10.7 OR LATER)" = "Use Lion full screen (OS X 10.7 or later)";
"USE CUSTOM TRANSITION ANIMATION" = "Use custom transition animation";
"ANIMATION" = "Animation";
"FULL SCREEN MONITOR" = "Full Screen Monitor";
"NAVIGATION MONITOR" = "Navigation Monitor";
    /* Preferences > General > Full Screen > ... Monitor: */
    "MONITOR MOVIE WINDOW IS ON" = "Monitor the Movie Window is On";
    "HIGHEST RES. MONITOR" = "Highest Res. Monitor";
    "LOWEST RES. MONITOR" = "Lowest Res. Monitor";
    "MONITOR CONTAINING MENU BAR" = "Monitor Containing Menu Bar";
    "MAIN MONITOR" = "Active Monitor";
"BLACK OUT OTHER MONITORS" = "Black out other monitors";
"AUTO SHOW DOCK" = "Auto show Dock";
//--
"SHOW PLAY TIME OR REMAINED TIME" = "Show play time or remained time";
"SHOW SYSTEM TIME" = "Show system time";
"TURN KEYBOARD BACKLIGHT OFF (OS X 10.6 ONLY)" = "Turn keyboard backlight off (OS X 10.6 only)";
//--
//"OPENING VIEW"
//"UNDER SCAN"

/* Preferences > General > UI/UX */

/* Preferences > Playlist */
"ADD MOVIE SERIES TO PLAYLIST" = "Add movie series to playlist";
"ADD SAME-NAMED SUBTITLE FILE WITH MOVIE" = "Add same-named subtitle files with movie";
"ADD ALL SUBTITLE FILES IN SUBTITLES SUBFOLDER" = "Add all subtitle files in subtitles subfolder";
"ADD ALL SUBTITLE FILES IF ONLY ONE MOVIE IN FOLDER" = "Add all subtitle files if only one movie in folder";
//--
"SETTINGS" = "Settings";
//"REPEAT"
//"SHUFFLE"
//--
//"KEEP CURRENT MOVIE SETTINGS"
"SOME SETTINGS OF CURRENT MOVIE WILL BE KEPT TO NEXT MOVIE." = "AV track selection, play speed, aspect ratio, screen filling, transform, image filters and audio equalizer settings of current movie will be kept to next movie.";
//--
"SKIP BEGINNING, ENDING" = "Skip Beginning, Ending";
"INTERVALS CAN BE SKIPPED." = "Intervals of beginning and ending can be skipped.\nSet intervals in playlist tab of Control Panel.";
//--
"WHEN ENDED" = "When Ended";
//--
"* THESE ARE DEFAULT VALUES FOR NEW PLAYLIST." = "* These are default values for new playlist. After creation, change in playlist tab of Control Panel.";
//--
"SHOW AUTO-ALERT FOR END-JOB WHEN ENDED" = "Show auto-alert for end-job when ended";

/* Preferences > Playback */
"START PLAY WHEN ENTER FULL SCREEN" = "Start play when enter full screen";
"STOP PLAY WHEN EXIT FULL SCREEN" = "Stop play when exit full screen";
//--
"NO SHORTCUT" = "No Shortcut";
"SEEK BY INTERVAL" = "Seek by interval";
"SEEK BY SUBTITLE" = "Seek to backward∙forward subtitle";
"SEEK BY CHAPTER"  = "Seek to backward∙forward chapter";
"SEEK BY BOOKMARK" = "Seek to backward∙forward bookmark";
"STEP FRAME" = "Step backward∙forward frame";
"HORIZONTAL SCROLL" = "Horizontal Scroll";
    /* Preferences > Playback > Horizontal Scroll */
    //"DO NOTHING"
    //"SEEK BY INTERVAL"
    //"SEEK BY SUBTITLE"
    //"STEP FRAME"
        //"SEC."
"USE KEY-FRAME SEEKING (FFMPEG ONLY)" = "Use key-frame seeking (FFmpeg Only)";
"KEY-FRAME SEEKING IS ..." = "Key-frame seeking is fast but may be inaccurate because it goes to the nearest key frame. If you want accuracy, turn it off. However, higher video resolution, slower seeking.\n\nThis option is only for single seeking by a key stroke or mouse click. Continuous seekings by key repeat or mouse dragging always go to key frames. The others like range-repeat or bookmark always go to accurate frames.";
"SPEED ADJUSTMENT UNIT" = "Speed Adjustment Unit";

/* Preferences > Video */
"USE H.264 VIDEO DECODE ACCELERATION (VDA)" = "Use H.264 video decode acceleration (VDA)";
"THIS COMPUTER SUPPORTS VDA" = "This computer supports VDA.";
"THIS COMPUTER DOES NOT SUPPORT VDA" = "This computer does not support VDA.";
"SOME H.264 VIDEO MAY BE NOT ACCELERATED." = "Some H.264 video may be not accelerated.";
"VIDEO TRACK ACCELERATED HAS BLUE TEXT." = "Video track in decode acceleration is displayed with blue text color in Properties tab of Control Panel.";
//--
//"ASPECT RATIO"
//"SCREEN FILLING"
"FOR WIDESCREEN MOVIE" = "for widescreen movie";
"FOR STANDARD MOVIE" = "for standard movie";
//--
"DEFAULT FILTER PRESET" = "Default Filter Preset";

/* Preferences > Audio */
"USE DIGITAL AUDIO OUT (S/PDIF)" = "Use digital audio out (S/PDIF)";
"CURRENT AUDIO OUT DEVICE SUPPORT S/PDIF" = "Current audio out device supports S/PDIF.";
"CURRENT AUDIO OUT DEVICE DOES NOT SUPPORT S/PDIF" = "Current audio out device does not support S/PDIF.";
"FFMPEG DECODER SUPPORTS AC3 AND DTS." = "FFmpeg decoder supports AC3 and DTS.";
"QUICKTIME DECODER SUPPORTS ..." = "QuickTime decoder does not support digital audio out any more in OS X 10.7 or later (because changing external preference is not allowed by App Sandbox).  In OS X 10.6, it supports AC3 only and needs Perian or A52Codec component.";
"AUDIO TRACK IN DIGITAL OUT HAS BLUE TEXT." = "Audio track in digital out is displayed with blue text color in Properties tab of Control Panel.";
//--
"USE VOLUME EXTENSION (UP TO 4.0)" = "Use volume extension (up to 4.0)";
"CHANGE DETAILED VOLUME (0.01 UNIT)" = "Change detailed volume (0.01 unit)";
//--
"CHANGE VOLUME BY VERTICAL SCROLL" = "Change volume by vertical scroll";
"CHANGE SYSTEM VOLUME" = "Change system volume";
"ABOUT SYSTEM VOLUME..." = "System volume will be changed instead of movie volume.\nSystem volume cannot be changed in digital out.";
//--
"DEFAULT EQUALIZER PRESET" = "Default Equalizer Preset";
//--
"SYNC. ADJUSTMENT UNIT" = "Sync. Adjustment Unit";
//"SEC."

/* Preferences > Subtitle */
"USE SUBTITLES @PREFS" = "Use subtitles";
//--
"STATUS MESSAGE" = "Status Message";
"INFO" = "Info";
"UPPER SUBTITLE" = "Upper Subtitle";
"CENTER SUBTITLE" = "Center Subtitle";
"LOWER SUBTITLE" = "Lower Subtitle";
"REMAINED TIME & SYSTEM TIME" = "Remained Time & System Time";
"NO LANGUAGE" = "No Language";
//--
"CURRENT DISPLAY" = "Current Display";
"SAMPLE MOVIE" = "Sample Movie";
//--
"PREFERRED SUBTITLE" = "Preferred Subtitle";
//"LETTER BOX HEIGHT";
//--
"TEXT ENCODING" = "Text Encoding";
"LOAD EMBEDDED SUBTITLES IN MOVIE FILE" = "Load embedded subtitles in movie file";
//--
//"SYNC. ADJUSTMENT UNIT"
//"SEC."

/* Preferences > Subtitle > Drawer */
"FONT" = "Font";
    /* Preferences > Subtitle > Drawer > Font: */
    "PROPORTIONAL SIZE" = "Proportional Size";
    "AUTO SIZE FOR" = "Auto Size for";
    "CHARACTERS." = "Characters";
    "MIN SIZE" = "min size";
    "MAX SIZE" = "max size";
//--
"TEXT" = "Text";
"STROKE" = "Stroke";
    "WIDTH" = "width";
"SHADOW" = "Shadow";
    "BLUR" = "blur";
    "DARKNESS" = "darkness";
    "OFFSET" = "offset";
    "DIRECTION" = "direction";
//--
"V-POSITION" = "V-Position";
    /* Preferences > Subtitle > Drawer > V-Position: */
    "VIEW TOP" = "View Top";
    "UPPER LETTER BOX" = "Upper Letter Box";
    //--
    "MOVIE TOP" = "Movie Top";
    "MOVIE CENTER" = "Movie Center";
    "MOVIE BOTTOM" = "Movie Bottom";
    //--
    "LOWER LETTER BOX" = "Lower Letter Box";
    "VIEW BOTTOM" = "View Bottom";
    //--
    "UPPER MARGIN" = "upper margin";
    "LOWER MRRGIN" = "lower margin";
"H-POSITION" = "H-Position";
    /* Preferences > Subtitle > Drawer > H-Position: */
    "VIEW LEFT" = "View Left";
    //--
    "MOVIE LEFT" = "Movie Left";
    "MOVIE CENTER" = "Movie Center";
    "MOVIE RIGHT" = "Movie Right";
    //--
    "VIEW RIGHT" = "View Right";
    //--
    "SIDE MARGIN" = "side margin";
    "LINE SPACING" = "line spacing";
//--
"LANGUAGE" = "Language";
"ENUMERATE LANGUAGE IDENTIFIERS." = "Enumerate language identifiers.";
//--
"USE FOR SUBTITLE ROTATION" = "Use for subtitle rotation";

/* Preferences > Subtitle > Subtitle Encoding */
"ADD, REMOVE OR REARRANGE ENCODINGS." = "Add, remove or rearrange by dragging string encoding for loading external subtitle file.";
"AUTODETECTION CONFIDENCE" = "Autodetection Confidence";
"AUTODETECT" = "Autodetect";
//"CLOSE"

/* Preferences > Navigation */
"LIST DISPLAY" = "List Display";
"USE PREVIEW" = "Use Preview";
"UNDERLINE MOVIE FILE WITH SUBTITLE FILES" = "Underline movie file with subtitle file(s)";
//--
"RUN NAVIGATION ON LAUNCH" = "Run navigation on launch";
//--
"ITEM" = "Item";
"LOCATION" = "Location";
//--
"MOVIES" = "Movies";
"ITUNES MOVIES" = "iTunes Movies";
"ITUNES TV SHOWS" = "iTunes TV Shows";
"ITUNES PODCASTS" = "iTunes Podcasts";
"ITUNES U" = "iTunes U";
"FOLDERS…" = "Folders…";
//--
"* PRESS AND HOLD APPLE REMOTE MENU BUTTON TO START NAVIGATION." = "* Press and Hold Apple Remote MENU button to start Navigation.";
"* PRESS AND HOLD APPLE REMOTE PLAY/PAUSE BUTTON TO SLEEP IN NAVIGATION" = "* Press and Hold Apple Remote PLAY/PAUSE button to Sleep in Navigation";

/* Preferences > Navigation > Add Folders... */
"ADD NAVIGATION FOLDERS MESSAGE" = "Choose folders to add to navigation List.";

/* Preferences > Shortcuts */
"COMMAND" = "Command";
"SHORTCUT" = "Shortcut";
"SHORTCUT 2" = "Shortcut 2";
"SPACE" = "Space";
"DUPLICATED SHORTCUT" = "Duplicated Shortcut";
"\"%@\" IS ALREADY ASSIGNED TO \"%@\"." = "\"%1$@\" is already assigned to \"%2$@\".";
"RESTORE DEFAULT" = "Restore Default";

/* Preferences > Advanced */
"CODEC BINDING" = "Codec Binding";
"OPTIONS" = "Options";
"SECURITY" = "Security";

/* Preferences > Advanced > Codec Binding */
"CODEC" = "Codec";
"DESCRIPTION" = "Description";
"DECODER" = "Decoder";
//--
"IF SPECIFIED DECODER FAILED, THEN THE OTHER WILL RETRY." = "If specified decoder failed, then the other will retry.";
//--
"OPEN .MOV FILE WITH QUICKTIME" = "Open .mov file with QuickTime";
"IF MOVIE HAS .MOV FILE EXTENSION, ..." = "If movie file has .mov file extension,\nthen open with QuickTime regardless of codec.";
//--
"SET ALL TO QUICKTIME" = "Set All to QuickTime";
"SET ALL TO FFMPEG" = "Set All to FFmpeg";
"SET ALL MPEG-4 TO QUICKTIME" = "Set All MPEG-4 to QuickTime";
"SET ALL MPEG-4 TO FFMPEG" = "Set All MPEG-4 to FFmpeg";
"SET TO MOVIST DEFAULT" = "Set to Movist Default";

/* Preferences > Advanced > Options */
//"GENERAL"
"NOTE RECENT DOCUMENT" = "Note Recent Document";
    /* Preferences > Advanced > Codec Binding > Note Recent Document */
    //"NEVER"
    "ONLY OPENED FILES FROM FINDER" = "Only opened files from Finder";
    "EVERY FILES" = "Every files";
"CLEAR RECENT DOCUMENTS WHEN QUIT" = "Clear recent documents when quit";
"RESTORE PLAY STATUS" = "Restore play status when window restored";
"RESTORE LAST CLOSED WINDOW" = "Restore last closed window when quit by closing";
//--
"WHEN FILE DRAGGED" = "When File Dragged";
"SHOW CONTROL PANEL AFTER" = "Show Control Panel after";
"ORDER FRONT WINDOW AFTER" = "Order front window after";
//"SEC."
//--
"SCREENSHOT" = "Screenshot Path & Type";
"SHOW THEME LAYOUT" = "Show theme layout";
//--
//"SUBTITLE"
"SHOW SUBTITLE RANGES IN SEEK BAR" = "Show subtitle ranges in seek bar";
"PRE-RENDERING" = "Pre-rendering";
"3D EFFECT" = "3D Effect";
//--
//"FFmpeg"
"USE FAST DECODING" = "Use Fast Decoding";
"IMAGE QUALITY MAY BE DETERIORATED." = "Image quality may be deteriorated. Use only for slow Mac. (reopen needed)";

/* Preferences > Advanced > Options > Screenshot Path */
"CHOOSE SCREENSHOT PATH MESSAGE" = "Choose a folder to save screenshots.";
"SCREENSHOT PATH IS ADDED TO ACCESSIBLE FOLDERS" = "Screenshot path is added to Accessible Folders.";
"%@ IS ADDED TO ACCESSIBLE FOLDERS" = "%@ is added to Accessible Folders automatically.";

/* Preferences > Advanced > Security */
"SANDBOX SECURITY DESC." = "In OS X 10.7 or later, App Sandbox allows to access user-selected files or folders only.\nWhen open a movie file, container folder should be scanned for filling playlist and searching subtitles. if folder has no access, auto playlist & subtitles will fail. When open playlist saved in 1.2.0 or earlier version, if movie or subtitle file in the playlist has no access, open will fail.\n\nIn OS X 10.7.3 or later, add favorite folders to Accessible Folders for persistent access.";
//--
"ACCESSIBLE FOLDERS (OS X 10.7.3 OR LATER)" = "Accessible Folders (OS X 10.7.3 or later)";
"* ACCESS IS APPLIED TO SUBFOLDERS RECURSIVELY." = "* Access is applied to subfolders recursively. Add the most possible parent folder.\n* User's Movies and their subfolders are always accessible by default.";
//--
"SHOW APP SANDBOX OPEN PANEL" = "Show open panel for temporary access if no access for folder when file open";

/* Preferences > Advanced > Security > Add Accessible Folders... */
"ADD ACCESSIBLE FOLDERS MESSAGE" = "Choose a folder to add to accessible folders";
"FOLDER NOT ADDED" = "Following folders not added";
"FOLDER NOT ADDED MESSAGE" = "Folder or one of folders in path is already accessible. It's unnecessary because access is applied to subfolders recursively.";
"SCREENSHOT PATH CANNOT BE REMOVED" = "Following folder cannot be removed because it's used as screenshot path.";

////////////////////////////////////////////////////////////////////////////////

/* Sheet: Main Menu > File > Open Files... */
"OPEN DOCUMENT MESSAGE" = "Choose movie or playlist files to open.";
"CANNOT LOAD PLAYLIST" = "Cannot Load Playlist.";

/* Sheet: Main Menu > File > Save Playlist... */
"SAVE PLAYLIST MESSAGE" = "Choose a playlist file to save.";
"CANNOT SAVE PLAYLIST" = "Cannot Save Playlist.";

/* Sheet: Main Menu > File > Add Files to Playlist... */
"ADD PLAYLIST ITEMS MESSAGE" = "Choose movie or playlist files to add to playlist.";

/* Sheet: Control Panel > Playlist > context menu > Add Subtitle Files... */
"ADD SUBTITLE FILES MESSAGE" = "Choose subtitle files to add to selected item.";

/* Sheet: playlist end-job */
"PLAYLIST ENDED" = "Playlist Ended";
"WINDOW WILL CLOSE AFTER %ld SEC." = "Window will close after %ld sec.";
"MOVIST WILL QUIT AFTER %ld SEC." = "Movist will quit after %ld sec.";
"SYSTEM WILL SLEEP AFTER %ld SEC." = "System will sleep after %ld sec.";
"SYSTEM WILL BE LOGGED OUT AFTER %ld SEC." = "System will be logged out after %ld sec.";
"SYSTEM WILL SHUT DOWN AFTER %ld SEC." = "System will shut down after %ld sec.";
"PERFORM NOW" = "Perform Now";

/* Sheet: add/edit bookmark(s) */
"ADD BOOKMARK" = "Add Bookmark";
"EDIT BOOKMARKS" = "Edit Bookmarks";
"REMOVE SELECTED" = "Remove Selected";
"TIME" = "Time";
"NAME" = "Name";

/* Sheet: load filters */
"LOAD FILTERS MESSAGE" = "Choose a Filter File to Load.";
"CANNOT LOAD FILTERS" = "Cannot Load Filters.";

/* Sheet: save loaded filters */
"ADD AS PRESET TITLE" = "Do you want to add the loaded filters as a preset?";
"ADD AS PRESET MESSAGE" = "\"Load Filters\" will be not supported any more in future version. You can add the loaded filters as a preset. Do you want to add as a preset?";
"ADD AS PRESET" = "Add as Preset";

/* Sheet: save filters (& messages) */
"SAVE FILTERS MESSAGE" = "Choose a Filter File to Save.";
"CANNOT SAVE FILTERS" = "Cannot Save Filters.";
"NO FILTER APPLIED" = "No Filter Applied.";

/* Sheet: add/edit filter preset(s) */
"ADD FILTER PRESET" = "Add Filter Preset";
"EDIT FILTER PRESETS" = "Edit Filter Presets";

/* Sheet: add/edit equalizer preset(s) */
"ADD EQUALIZER PRESET" = "Add Equalizer Preset";
"EDIT EQUALIZER PRESETS" = "Edit Equalizer Presets";

////////////////////////////////////////////////////////////////////////////////

/* Status: movie open */
"OPENING…" = "Opening…";
"OPENING WITH %@…" = "Opening with %@…";
"FFMOVIE INVALID PARAM" = "FFmpeg invalid param.";
"FFMOVIE INIT TRACKS FAILED" = "FFmpeg init tracks failed";
"FFMOVIE INIT PLAYBACK FAILED" = "FFmpeg init playback failed";

/* Status: playback */
"LAST PLAY POSITION" = "Last Play Position";
"SKIP BEGINNING" = "Skip Beginning";
"CHAPTER" = "Chapter";
"BOOKMARK" = "Bookmark";
"PLAY SPEED" = "Play Speed";

/* Status: video */
"RESET TRANSFORM" = "RESET TRANSFORM";
"FILTERS LOADED" = "Filters Loaded";
"FILTERS SAVED" = "Filters Saved";
"FILTER PRESET APPLIED" = "Filter Preset Applied";
"FILTER ADDED" = "Filter Added";
"FILTER REMOVED" = "Filter Removed";
"ALL FILTERS REMOVED" = "All Filters Removed";

/* Status: audio */
"AUDIO DEFAULT SYNC." = "Audio Default Sync.";
"AUDIO PULL" = "Audio Pull";
"AUDIO PUSH" = "Audio Push";
"VOLUME" = "Volume";
"SYSTEM VOLUME" = "System Volume";
"MOVIE IS MUTED" = "Movie is muted. Unmute Movie";
"VOLUME WARNING IN DIGITAL OUT" = "Volume cannot be changed in Digital-Out";
"SYSTEM IS MUTED" = "System is muted. Unmute System";
"SYSTEM VOLUME WARNING IN SPDIF" = "System Volume cannot be changed in Digital-Out Device";

/* Status: subtitle */
"DECREASE SUBTITLE SIZE" = "Decrease Subtitle Size";
"INCREASE SUBTITLE SIZE" = "Increase Subtitle Size";
"DEFAULT SUBTITLE SIZE" = "Default Subtitle Size";
"PULL SUBTITLE SYNC." = "Pull Subtitle Sync.";
"PUSH SUBTITLE SYNC." = "Push Subtitle Sync.";
"DEFAULT SUBTITLE SYNC." = "Default Subtitle Sync.";
"SUBTITLE SLOWER" = "Subtitle Slower";
"SUBTITLE FASTER" = "Subtitle Faster";
"DEFAULT SUBTITLE SPEED" = "Default Subtitle Speed";
"SUBTITLE DISPLAY TYPE" = "Subtitle Display Type";
"SUBTITLE 3D EFFECT" = "Subtitle 3D Effect";
"NO SUBTITLE TO USE FOR ROTATION" = "No subtitle to use for rotation";
"SET USE FOR ROTATION IN PREFERENCES" = "\nSet \"Use for Subtitle Rotation\" of each subtitle in Preferences";

////////////////////////////////////////////////////////////////////////////////

/* Etc.: screenshot error message */
"SCREENSHOT PATH NOT SPECIFIED" = "Screenshot Path Not Specified";
"SET SCREENSHOT PATH IN PREFERENCES" = "Please, set screenshot path in Preferences.";
"SCREENSHOT PATH NOT ACCESSIBLE" = "Screenshot Path Not Accessible";
"SET SCREENSHOT PATH AGAIN: %@" = "Screenshot path is not accessible. It may be caused by App Sandbox. If it's set in previous non App Sandboxed version, then set it again in Preferences to get access.\n\n%@";

/* Etc: theme */
"THEME ERROR" = "Theme Error";
"THEME FOLDER NOT FOUND" = "Theme Folder Not Found";
"%@/%@ NOT FOUND" = "%@/%@ Not Found";
"FONT LOAD FAILED" = "Font Load Failed";
"DEFAULT THEME WILL BE LOADED" = "Default theme will be loaded.";
"DOWNLOAD MOVIST AGAIN" = "Download Movist Again.";

/* Etc.: Main Menu > Movist > Send Bug Report */
"BUG REPORT SUBJECT" = "Movist Bug Report";
"BUG REPORT BODY FORMAT" = "* OS: %@\n* Movist: Version %@\n\n* What steps will reproduce the problem?\n1. \n2. \n3. \n\n* What is the expected output? What do you see instead?\n\n\n* Please use labels and text to provide additional information. (Enter the movie file name and attach crash reports, console logs, subtitle files)\n\n\n* Please attach preference file. (A Finder window opens for the file)";

/* Etc. */
"SUBTITLE TEST CHAR" = "H";

////////////////////////////////////////////////////////////////////////////////

/* SPECIAL: preferences subtitle language identifiers */
"UPPER SUBTITLE LANGUAGE IDENTIFIERS" = "";
"CENTER SUBTITLE LANGUAGE IDENTIFIERS" = "";
"LOWER SUBTITLE LANGUAGE IDENTIFIERS" = "English, eng, en, us, ENCC";

